//#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//#include <math.h>

//1:输入三个数字由大到小输出
/*
int main(void)
{
	int a = 0;
	int b = 0;
	int c = 0;
	printf("请输入三个数\n");
	scanf("%d%d%d", &a, &b, &c);
	if (a < b)
	{
		int temp = a;
		a = b;
		b = temp;
	}
	if (a < c)
	{
		int temp = a;
		a = c;
		c = temp;
	}
	if (b < c)
	{
		int temp = b;
		b = c;
		c = temp;
	}
	printf("%d %d %d\n", a, b, c);
}
*/


//**************************************************************************
//2:打印1-100之间所有3的倍数的数字
/*
int main(void)
{
	int i = 0;
	while (i<101)
	{
		i++;
		if (i % 3 != 0)
			continue;
		printf("%d\n", i);
	}
	return 0;

}
*/

//***************************************************
//3：给定两个数，求这两个数的最大公约数
//我自己的想法
/*
int main(void)
{
	int m = 0;
	int n = 0;
	int i = 1;
	printf("请输入两个数\n");
	scanf("%d%d", &m, &n);
	if (m < n)
	{
		int temp = m;
		m = n;
		n = temp;
	}
	for (i = n; i > 0; i--)
	{
		if (m%i == 0 && n%i == 0)
		{ 
			printf("最大公约数为%i\n", i);
			break;
		}
	}
	return 0;
}
*/
//辗转相除法
/*
int main(void)
{
	int m = 0;
	int n = 0;
	int r = 0;
	printf("请输入两个数\n");
	scanf("%d%d", &m, &n);
	while (m%n)
	{
		r = m % n;
		m = n;
		n = r;
	}
	printf("%d", n);
	return	0;
}
*/

//*****************************************************************
//4：打印1000-2000年的闰年
//判定闰年的两种规则：1：能被4整除并且不能被100整除是闰年
				//	2：能被400整除是闰年
/*
int main(void)

{
	int year = 0;
	int count = 0;//用于统计闰年的个数
	for (year = 1000; year < 2001; year++)
	{
		if (year % 4 == 0 && year % 100 != 0)//比如1600年是闰年，但是它不满足这种情况，就要
											 //就要用下面的方法
		{
			printf("%d  ", year);
			count++;//打印一次增加一个
		}
		else if (year % 400 == 0)
		{
			printf("%d  ", year);
			count++;
		}
	}
	printf("\n1000-2000年的闰年个数为%d\n", count);
}
*/

//**************************************************************************************8
//5:打印100-200的素数
//素数的定义：只能被1被自身整除的数
//试除法：设需要判断的数为n，从2开始到n去整除这个数，如果其中有任何一种情况整除了，就不是素数
/*
int main(void)
{
	int i = 0;
	int j = 0;
	int count = 0;//用于计数
	for (i = 1; i <= 1000000; i++)//这个for循环用于判断100，101,102......是否为素数，每次进入一个数
	{
		int j = 0;//这里必须将j重置为0，不然j会累加
		for (j = 2; j < i; j++)//进入一个数后，就从2开始到这个数减1，开始整除
		{
			if (i%j == 0)//如果进来判断的数整除了某个数，那么就表示是素数，跳出循环
			{
				break;
			}
		}
		if (i == j)//程序执行到这要么是跳出了循环，要么是第二个循环执行完了还没有取余等于0的情况。
				   //而只有第二种情况才说明它是素数，所以这里判断一下
		{
			count++;//增加1次
			printf("%d  ", i);
		}

	}
	printf("\n100-200之间的素数有%d\n个", count);
	return 0;
}
*/
//试除法(改进)：上述方法效率其实有点低，如果一个数i不是素数，那么它一定能表示为i=a*b，且a和b中至少
//             至少有一个数字小于根号下i，所以只需判断到根号下i即可
//			   偶数不可能为素数，所以i从1开始，每次i+=2，直接从奇数找素数就效率更高了
/*
int main(void)
{
	int i = 0;
	int j = 0;
	int count = 0;
	for (i = 1; i <= 1000000; i+=2)
	{
		int j = 0;
		for (j = 2; j<=sqrt(i); j++)//只需到sqrt就可以了
		{
			if (i%j == 0)
			{
				break;
			}
		}
		if (i >sqrt(i))//这里也要改
				   
		{
			count++;
			printf("%d  ", i);
		}

	}
	printf("\n100-200之间的素数有%d\n个", count);
	return 0;
}
*/


//*******************************************************************************


//6:编写程序数1-100所有整数中出现多少个数字“9”
/*
int main(void)
{
	int i = 0;
	int count = 0;
	for (i = 1; i <= 100; i++)
	{
		if (i % 10 == 9)//如果i对10取余为9，表示这个数字个位为9，即01,02,03......
		{
			count++;
		}
		if (i / 10 == 9)//如果i对10整除，表示这个数字10位为10，即10,20,30,40......
		{
			count++;
		}
	}
	printf("%d", count);
}
*/


//******************************************************************************


//7:计算1/1-1/2+1/3-1/4+1/5........+1/99-1/100的值
/*
int main(void)
{
	int i = 0;
	double sum = 0;//存储的结果是浮点型，定义为double
	int flag = 1;
	for (i = 1; i <= 100; i++)
	{
		sum = sum + flag*(1.0 / i);//两个数相除，其中一个数必须为浮点数，结果才能是浮点数，所以1要写成1.0
		flag = -flag;
	}
	printf("%lf\n", sum);//注意格式
	return 0;
}
*/

//*******************************************************************************

//8:求出10个整数的最大值
/*
int main(void)
{
	int arr1[] = { 1,3,2,31,1,2,3,1,12,8 };
	int max = arr1[0];
	int i = 0;
	int len = sizeof(arr1) / sizeof(arr1[1]);
	for (i = 1; i <= len; i++)
	{
		if (arr1[i] > max)
			max = arr1[i];
	}
	printf("%d\n", max);
	return 0;
}
*/


//********************************************************************************
//9:输出九九乘法表
/*
int main(void)
{
	int i = 0;
	int j = 0;
	for (i = 1; i <= 9; i++)
	{
		for (j = 1; j <= i; j++)
			printf("%d*%d=%-2d  ", i, j, i*j);//%-2d表示两位左对齐
		printf("\n");
	}
	return 0;
}
*/


//*****************************************************************